Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: བདེ་གཤེགས་འཁྲུག་མེད་ཚོང་དཔོན་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ནམ་མཁའི་བློ་དེ་ལ། །ནོར་བུ་རིན་ཆེན་གླེགས་མ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Akṣobhya, when the son of a merchant, Offered a jewel-studded book cover Before the thus-gone Sky Mind And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དྲི་མ་རབ་ཞི་ཕྱུག་པོ་ཡི། །བུ་ཚེ་དེ་བཞིན་གཤེགས་པ་རླབས་འཇོམས་ལ། །གདུ་བུ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Praśāntamala, when the son of a rich man, Offered bracelets Before the thus-gone Conquering the Waves And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཕྱོགས་མ་བསླད་པ་ཁྱིམ་བདག་གི། །བུ་ཚེ་བདེ་གཤེགས་ཤེས་རབ་རྫོགས་པ་ལ། །མར་ཁུར་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Deśāmūḍha, when the son of a householder, Offered clarified butter Before the well-gone Perfect Insight And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མཛེས་པ་བུ་རམ་ཤིང་སྲུངས་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཚེར་མ་དཀྲུགས་པ་ལ། །བུ་རམ་ཤིང་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Laḍita, when the guardian of a sugarcane field, Offered sugarcane fields Before the thus-gone Disturber of Thorns And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཞལ་བཟངས་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་དགྲ་འདུལ་དེ་ལ་ནི། །མུ་ཏིག་དམར་པོ་དག་གིས་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Suvaktra, when a businessman, Scattered red pearls Before the thus-gone Tamer of Enemies And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཤུགས་གནས་ཡེ་ཤེས་རྫ་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་དགྱེས་པ་ལ། །བུམ་པ་ཆུ་ཡིས་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sthita­vega­jñāna, when a potter, Offered a jar filled with water Before the thus-gone Delighting the Worthy Ones And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གསུང་དབང་བཅའ་བ་མཁན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཚུལ་ཁྲིམས་མཆོག་གནས་ལ། །བཅའ་བ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Kathendra, when a cook, Offered food Before the thus-gone Abiding by Supreme Discipline And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གཟི་བརྗིད་ཆེན་པོ་སྨན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཕྱོགས་མཉམ་དགོངས་པ་ལ། །སྐྱུ་རུ་ར་ཡི་འབྲས་བུ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Mahātejas, when a physician, Offered myrobalan fruit Before the thus-gone Equal Intent in All Directions And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བློ་གྲོས་ཟབ་མོ་ཁྱིམ་བདག་ཚེ། །དེ་བཞིན་གཤེགས་པ་དགོངས་པ་བསྙེངས་མེད་ལ། །མུ་ཏིག་འབྲུམ་བུ་གསུམ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Gambhīramati, when a householder, Offered three pearls Before the thus-gone Fearless Intent And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བདུད་རྩི་གཞན་གྱི་ཁོལ་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བརྩོན་འགྲུས་གསལ་བ་དེའི། །འཆག་སར་ལྗོན་ཤིང་རིག་བྱེད་བསྐྲུན་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Amṛta, when a servant of others, Offered a palisade of trees for the monastic walkway Of the thus-gone Luminous Diligence And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཆོས་སྟོབས་ཚལ་གྱི་ལས་བྱེད་ཚེ། །དེ་བཞིན་གཤེགས་པ་གསལ་བ་རྒྱ་ཆེན་ལ། །འོད་མའི་ཚལ་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Dharmabala, when a gardener, Offered a bamboo grove Before the thus-gone Vast Luminosity And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་མཆོད་ལྡན་རྒན་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་གསན་པའི་བློ་ལྡན་ལ། །རྩྭ་ཡི་རོ་བཅུད་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Pūjya, when an old man, Offered herbal grass juice Before the thus-gone Intelligent Listener And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མེ་ཏོག་འོད་ནི་ལམ་སྟོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྒྲིབ་མེད་དགོངས་པ་དེའི། །ལམ་དག་ཉེ་བར་མཚོན་པ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Puṣpaprabha, when a guide, Showed the way Before the thus-gone Stainless Intent And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཁམས་གསུམ་མཆོད་གནས་གསེར་རྟོག་ཚེ། །དེ་བཞིན་གཤེགས་པ་བསྙེངས་མེད་འོད་ཟེར་ལ། །གསེར་སྲང་གཅིག་ཅིག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Trailokyapūjya, when a gold expert, Offered a measure of gold Before the thus-gone Light Rays of Fearlessness And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྒྲ་གཅན་ཉི་མའི་སྙིང་པོ་ཕྱེ་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་དབྱངས་ཅན་དེ་ལ་ནི། །ཀཱར་ཥཱ་པ་ནི་རི་བའི་ཕྱེ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Rāhu­sūrya­garbha, when a flour merchant, Offered a kārṣapana’s worth of flour Before the thus-gone Nectar Melody And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ལྷས་མཆོད་རྩལ་ཆེན་བྲམ་ཟེའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལེགས་པར་གསུངས་པ་དེ་ཡི་ནི། །འཁོར་གྱི་ཁྱམས་དག་གསེར་གྱི་སྣམ་བུ་བཏིང་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Marutpūjita, when a powerful brahmin, Spread a golden blanket in the courtyard Before the thus-gone Excellent Speech And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཐར་པའི་རྒྱལ་མཚན་རས་བལ་མཁན། །བྱེད་ཚེ་བདེ་གཤེགས་མཁས་པ་མཆོག་དེ་ལ། །རས་བལ་དག་ནི་གཏོར་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Mokṣadhvaja, when an expert on cotton textiles, Scattered raw cotton Before the well-gone Supreme Expert And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བདུད་རྩིའི་འོད་ནི་གཙང་སྦྲ་ཅན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་རྒྱལ་པོ་དེ་ལ་ནི། །སུ་དར་ཤ་ནའི་མེ་ཏོག་གཏོར་བ་བྱས་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: The well-gone Amṛtaprabha, when a brahmin versed in the Vedas Scattered sudarśana flowers Before the thus-gone King of Excellent Qualities And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེ་མི་བཀྲེན་ཚེ། །དེ་བཞིན་གཤེགས་པ་དབང་པོ་སྦས་པ་ལ། །རྒྱ་སྲན་དག་གི་ཕྱེ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Vajra, when a destitute, Offered half a bean Before the thus-gone Hidden Faculties And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་བརྟན་པ་ཕྲེང་རྒྱུད་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཐར་པའི་བསམ་གཏན་ལ། །སབ་ཏ་པ་རྣའི་མེ་ཏོག་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Dṛḍha, when a garland maker, Scattered sapataparṇi flowers Before the thus-gone Liberating Concentration And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྣང་ལྡན་ཆེན་པོ་ལམ་དུ་ཞུགས་པ་ན། །བདེ་གཤེགས་རིན་ཆེན་ཕུང་པོ་འགྲོན་པོ་བྱེད་པ་ཡིས། །ནམ་གྱི་གུང་ཐུན་དག་ལ་མེལ་ཚེ་བྱས་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnaskandha, when a traveler, Visited the well-gone Great Light Bearer, Serving as a midnight watchman, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མཛེས་གཤེགས་རྩིས་པའི་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཙན་དན་སྤོས་དེ་ལ། །ཙམ་པ་ཀ་ཡི་མེ་ཏོག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Laḍitakrama, when the son of an astrologer, Offered campaka flowers To the thus-gone Sandalwood Fragrance And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཉི་མ་ལྟར་གཤེགས་མར་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཟིགས་པ་གསལ་དེ་ལ། །མར་ཁུའི་བཏུང་བ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Bhānumat, when a butter merchant, Offered a drink of clarified butter To the thus-gone Clear Vision And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དག་པའི་འོད་ནི་དགེ་སློང་ཚེ། །བདེ་གཤེགས་མངོན་འཕགས་སྟེགས་དེའི་འཆག་ས་དག །ཆག་ཆག་ཕྱག་དར་བྱས་ཏེ་སྟན་བཏིང་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Śuddhaprabha, when a monk, Washed and swept a monastic walkway, and prepared a seat For the well-gone Superior Support, And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་འོད་ཤུགས་ཚོང་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་བལྟ་ན་སྡུག་དེ་ལ། །སྣང་སྒྲོན་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Prabhābala, when a merchant, Offered shining lamps To the thus-gone Beautiful to Behold And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡོན་ཏན་གཙུག་ནི་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་དཔག་མེད་བློ་དེ་ལ། །ཙན་དན་དང་ནི་འབྲས་བུ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Guṇacūḍa, when a merchant, Offered sandalwood and fruits To the thus-gone Unfathomable Mind And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དཔལ་རྫོགས་བཙོ་བླག་མཁན་གྱི་ཚེ། །བདེ་གཤེགས་ཉི་མ་སྟོང་ལྡན་གཟི་བརྗིད་ལ། །སོས་ཀ་ཚ་བའི་དུས་སུ་སྐྱེམ་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Anupamaśrī, when a washerman, Offered a beverage during the pre-monsoon heat To the well-gone Splendor of a Thousand Suns And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སེང་སྟབས་རྒྱལ་པོའི་བུ་མོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཁུར་བོར་དེ་ལ་ནི། །ཆོས་ཀྱི་གདན་དག་གདིང་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Siṃhagati, when a princess, Prepared a Dharma seat For the thus-gone Laying Down the Load And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གྱེན་དུ་འཕགས་པ་ཤིང་སྲུངས་ཚེ། །དེ་བཞིན་གཤེགས་པ་གསལ་བར་གྲགས་དེ་ལ། །ཡུངས་ཀར་སྤར་བ་བཀང་སྟེ་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Udgata, when a forest guard, Scattered a handful of mustard seeds Before the thus-gone Famed Clarity And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མེ་ཏོག་བྱིན་པ་ཤིང་སྲུངས་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཕྱོགས་སུ་རྣམ་གྲགས་ལ། །ཨེ་རཎྜ་ཡི་འབྲས་བུ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Puṣpadatta, when a forest guard, Offered eraṇḍa fruits To the thus-gone Universally Renowned And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་འོད་འགྱེད་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་དབང་སྒྱུར་རྒྱལ་པོ་ལ། །མུ་ཏིག་སྤར་བ་བཀང་སྟེ་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Muktaprabha, when a merchant, Scattered a handful of pearls Before the thus-gone Masterful King And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་པད་མ་ཞིང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཐའ་ཡས་བློ་དེ་ལ། །ལྷུང་བཟེད་ལོ་ཐོག་སར་པས་བཀང་སྟེ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Padma, when a farmer, Offered an alms bowl filled with fresh crops To the thus-gone Infinite Mind And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡེ་ཤེས་དགྱེས་པ་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་ཡངས་པ་ལ། །བུ་རམ་གོང་བུ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jñānapriya, when a merchant, Offered a lump of molasses To the thus-gone Vast Radiance And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བཀོད་པ་མཛེས་པ་ཤིང་སྲུངས་ཚེ། །དེ་བཞིན་གཤེགས་པ་བཀོད་པ་གསལ་དེ་ལ། །སོའུ་གན་དྷི་དག་སྙིམ་པ་བཀང་སྟེ་གཏོར། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Laḍitavyūha, when a forest guard, Scattered handfuls of saugandhin flowers Before the thus-gone Luminous Array And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གཏི་མུག་མེད་གནས་བྲམ་ཟེའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྤྱན་མཆོག་དེ་ལ་ནི། །མིག་མི་འཛུམས་པས་བལྟ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Amohavihārin, when a brahmin, Gazed without blinking Before the thus-gone Supreme Eye And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་རྨ་མེད་ལྷམ་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཐར་པའི་བརྟུལ་ཞུགས་ལ། །མཆིལ་ལྷམ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Avraṇa, when a shoemaker, Offered footwear To the thus-gone Yogic Discipline of Liberation And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཏོག་གི་རྒྱལ་མཚན་གྲོང་རྡལ་གྱི། །ཁྱེའུ་ཚེ་བདེ་གཤེགས་ཡིད་འོང་གཟིགས་དེ་ལ། །མེ་ཏོག་བར་ཤིའི་ཕྲེང་བ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ketudhvaja, when a village boy, Offered a garland of vārṣikī flowers To the well-gone Beautiful Vision And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བདེ་བར་དགོངས་པ་ཤིང་ཐུན་ཚེ། །དེ་བཞིན་གཤེགས་པ་འོད་འབར་དེ་ལ་ནི། །ཨུད་པལ་དམར་པོ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sukhacittin, when a wood gatherer, Offered red utpalas To the thus-gone Blazing Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གཏི་མུག་མེད་རྒྱལ་འཁོར་སྒྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་དབྱངས་ཆེན་དེ་ལ་ནི། །ན་བཟའ་རིན་པོ་ཆེ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vimoharāja, when a universal monarch, Offered precious garments To the thus-gone Great Melody And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཆོ་ག་མཁྱེན་པ་བློན་ཆེའི་ཚེ། །འོབས་སུ་སྟེགས་དག་གཟུགས་པ་བྱས་ནས་ཀྱང་། །བདེ་གཤེགས་འོད་ཕུང་གཟི་བརྗིད་ཆེན་པོ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vidhijña, when a chief minister, Made a bridge across an abyss For the well-gone Splendid Mass of Light, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དག་པའི་རྒྱ་མཚོ་ཚོང་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཏོག་གི་འོད་དེ་ལ། །ཁྲུས་ཁང་དག་ནི་བྱས་ཏེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Śuddhasāgara, when a merchant, Offered bathing houses To the thus-gone Crest LightAnd in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་ཆེན་མངའ་བ་རྩིས་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་མཆོད་གནས་ལ། །མཆིལ་ལྷམ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnadhara, when an astrologer, Offered footwear To the thus-gone Receiver of the Worship of the Worthy And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མི་དམའ་བ་ནི་ཤིང་སྲུངས་ཚེ། །བདེ་གཤེགས་ཡོན་ཏན་གཟི་བརྗིད་ཕུང་པོ་ལ། །རྒུན་ཆབ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Anavanata, when a forest guard, Offered grape juice To the well-gone Mass of Splendid Qualities And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྐྱེ་བོ་དགའ་མཛད་དགེ་སློང་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཚན་གསལ་དེ་ལ་ནི། །སྤོས་ནི་སྲང་གི་བཞི་ཆ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jagattoṣaṇa, when a monk, Offered a quarter measure of incense To the thus-gone Clear Marks And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྨ་བྱའི་ང་རོ་རྩིས་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་འོད་འཕྲོ་ཆེན་པོ་ལ། །སྐྱེད་མོས་ཚལ་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Mayūraruta, when an astrologer, Offered parks To the thus-gone Great Radiance And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མ་ཞུམ་པ་ནི་རྔོན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་གསལ་དེ་ལ། །སྐྱོ་མ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Adīna, when a hunter, Offered gruel To the thus-gone Light of the Worthy Ones And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྲིད་སྲེད་དྲི་སྤངས་ཤིང་སྲུངས་ཚེ། །དེ་བཞིན་གཤེགས་པ་དགོངས་པ་ལེགས་གནས་ལ། །ཤིང་ཤ་པ་ཡི་མེ་ཏོག་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Bhava­tṛṣṇā­mala­prahīṇa, when a forest guard, Scattered śiṃśapā flowers Before the thus-gone Mind of Excellent Adherence And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྤྱོད་པའི་སྟེགས་ནི་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྟེགས་ནི་བཟང་པོ་ལ། །སྲན་ཆུང་དང་ནི་འབྲས་ཆན་གཟེགས་མ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Cāritratīrtha, when a merchant, Offered bits of lentils and boiled rice To the thus-gone Excellent Support And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལྷ་མང་སྙན་བསྒྲགས་རིམ་གྲོ་པ། །བྱེད་ཚེ་བདེ་གཤེགས་ཡེ་ཤེས་འབྱུང་གནས་ལ། །རྡོ་ཡི་གདན་ཁྲི་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Bahudevaghuṣṭa, when serving as an attendant, Offered a throne of stone To the well-gone Source of Wisdom And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་ཆེན་སྟོབས་ནི་ཞིང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཀུན་དུ་རིན་ཆེན་ལ། །གྲོ་ཡིས་སྤར་བ་བཀང་སྟེ་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnakrama, when a farmer, Filled his hands with wheat and scattered it Before the thus-gone Universal Jewel And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་པད་བསྣམས་བཙོ་བླག་མཁན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཉི་མའི་ཕུང་པོ་དེའི། །ན་བཟའ་དག་ནི་བཀྲུ་བཤལ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Padmahastin, when a washerman, Washed the robes Of the thus-gone Sun Mass And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དཔལ་ནི་ཁྱིམ་བདག་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྟོན་པའི་སྟེགས་དེ་ལ། །བཞུགས་གདན་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Śrī, when a householder, Offered a seat To the thus-gone Support of the Teacher And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དགྲ་རྒྱལ་བྲམ་ཟེའི་ཆུང་མའི་ཚེ། །བདེ་གཤེགས་ཁྲོ་འཇོམས་བྱང་ཆུབ་སྙིང་པོར་ནི། །གཤེགས་ཚེ་སྦྲང་རྩིར་བསྲེས་པའི་འོ་མ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jitaśatru, when the wife of a brahmin, Offered milk mixed with honey When the well-gone Destroyer of Anger proceeded to the seat of awakening, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འབྱོར་ལྡན་གྲགས་པ་སློང་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སེང་གེའི་སྐུ་དེ་ལ། །ཨུ་དུམ་བཱ་རའི་འབྲས་བུ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Samṛddhayaśas, when a beggar, Offered udumbara fruits To the thus-gone Lion Body And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡུལ་འཁོར་བཟང་པོ་ཕྲེང་རྒྱུད་བུ་མོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བཤེས་གཉེན་གྲགས་པའི་འོད་དེ་ལ། །ཤིང་འཛམ་བུ་ཡི་འབྲས་བུ་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Surāṣṭra, when the daughter of a garland maker, Offered a jambu fruit To the thus-gone Light of the Renowned Friend And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མེ་ཏོག་འོད་ནི་ཕྱུགས་རྫིའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ང་རོ་རྣམ་དག་ལ། །ལྷུང་བཟེད་དར་བས་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Kusumaprabha, when a cattle herder, Offered an alms bowl filled with buttermilk To the thus-gone Pure Roar And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སེང་གེའི་ང་རོ་བྲམ་ཟེའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བཟང་པོ་བཞེད་དེ་ལ། །བསྟོད་པ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Siṃhasvara, when a brahmin, Offered praises To the thus-gone Excellent Assertion And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཟླ་ལྟར་ཤར་བ་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་རབ་ཞི་བདག་པོ་ལ། །དངུལ་ལས་བྱས་པའི་ལྷུང་བཟེད་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Candrodgata, when a merchant, Offered an alms bowl of silver To the thus-gone Lord of Peace And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འཇོམས་པའི་མཆོག་ནི་ཚོང་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་དུལ་བའི་གཟི་བརྗིད་ཀྱི། །གཙུག་ལག་ཁང་ནི་ཙན་དན་དམར་པོས་བྱུགས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Damajyeṣṭha, when a merchant, Anointed a monastic temple with red sandalwood Before the thus-gone Splendor of Training And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་མི་གཡོ་ཕྲེང་རྒྱུད་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་ལེགས་མཆོད་ལ། །མེ་ཏོག་བླ་རེ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Acala, when a garland maker, Offered a flower canopy To the thus-gone Excellent Worship of Splendor And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཕན་ལྡན་གཤེགས་པ་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་འོད་དེ་ལ། །དངུལ་ལས་བྱས་པའི་མེ་ཏོག་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Upakāragati, when a merchant, Scattered flowers of silver Before the thus-gone Light of the WorldAnd in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བསོད་ནམས་སྒྲོན་མ་རྒྱལ་པོའི་འཁོར་སྒྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་དག་གི་མཆོད་རྟེན་དེའི། །གདུགས་ཚོད་ལོ་གྲངས་བདུན་སྟོང་བར་དུ་སྦྱར་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Puṇya­pradīpa­rāja, when a universal monarch, Provided midday meals for seven thousand years For the thus-gone Stūpa for the World And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྒྲ་དབྱངས་སྐུལ་བ་དེད་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྤྱོད་པ་དག་པ་དེའི། །གཙུག་ལག་ཁང་ནི་ཙན་དན་དམར་པོས་བྱས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Svaracodaka, when a captain, Built a monastic temple of red sandalwood For the thus-gone Pure Conduct And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གཽ་ཏམ་ནི་ལམ་སྟོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྟེགས་བཟང་གཟི་བརྗིད་ལ། །གདུགས་ཚོད་དག་ནི་སྦྱར་ཏེ་གསོལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Gautama, when a guide, Prepared and offered midday meals Before the thus-gone Splendor of Excellent Steps And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མདངས་སྟོབས་བྲམ་ཟེའི་ཁྱེའུ་ཡ་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྤྱན་མཆོག་དེ་ཡི་ནི། །ལམ་སྲང་དག་ནི་ཕྱག་དར་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ojobala, when a brahmin youth, Swept the road Before the thus-gone Supreme Eye And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བློ་གནས་རང་བཞིན་ཤིང་རྟ་མཁན། །བྱེད་ཚེ་བདེ་གཤེགས་མཐུ་རྩལ་ཆེན་པོ་ལ། །ཤིང་རྟ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sthita­buddhi­rūpa, when a chariot maker, Offered a chariot To the well-gone Great Power And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཟླ་བ་བཟང་པོ་མི་བཀྲེན་ཚེ། །དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་གཟུགས་དེ་ལ། །མར་མེ་ཁ་ཅིག་གཅིག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sucandra, when a destitute, Offered a single lamp To the thus-gone Nectar Form And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་ཡན་ལག་མེ་ཏོག་ནི། །ཤིང་ཏོག་འཚོང་ཚེ་བདེ་གཤེགས་ཤེས་རབ་མངའ་བ་ལ། །ཨ་མྲའི་འབྲས་བུ་གསུམ་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Bodhyaṅgapuṣpa, when a fruit vendor, Offered three mangoes To the well-gone Master of Insight And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བཀྲ་ཤིས་སྤོས་འཚོང་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་སྟེགས་དེ་ལ། །ཙམ་པ་ཀ་ཡི་མེ་ཏོག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Siddhi, when the son of an incense merchant, Offered campaka flowers To the thus-gone Support for Qualities And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལེགས་པར་སྟོན་པ་འཁོར་ལོས་སྒྱུར་བ་ཡི། །བློན་པོའི་ཚེ་ན་བདེ་གཤེགས་ལྷུན་པོའི་འོད་དེ་ཡི། །འཆག་ས་དག་ནི་བཻ་དཱུརྱ་ལས་བྱས་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Praśasta, when the minister of a universal monarch, Offered a monastic walkway made of beryl To the well-gone Mountain of Light And in doing so first gave rise to the mind of awakening.
